GopalSaraf/Practicals/PSDL/include/proc/pic18f2580.inc
// Register: RXFBCON1
#define RXFBCON1 RXFBCON1
RXFBCON1                                 equ 0DE1h
// bitfield definitions
RXFBCON1_F2BP_0_POSN                     equ 0000h
RXFBCON1_F2BP_0_POSITION                 equ 0000h
RXFBCON1_F2BP_0_SIZE                     equ 0001h
RXFBCON1_F2BP_0_LENGTH                   equ 0001h
RXFBCON1_F2BP_0_MASK                     equ 0001h
RXFBCON1_F2BP_1_POSN                     equ 0001h
RXFBCON1_F2BP_1_POSITION                 equ 0001h
RXFBCON1_F2BP_1_SIZE                     equ 0001h
RXFBCON1_F2BP_1_LENGTH                   equ 0001h
RXFBCON1_F2BP_1_MASK                     equ 0002h
RXFBCON1_F2BP_2_POSN                     equ 0002h
RXFBCON1_F2BP_2_POSITION                 equ 0002h
RXFBCON1_F2BP_2_SIZE                     equ 0001h
RXFBCON1_F2BP_2_LENGTH                   equ 0001h
RXFBCON1_F2BP_2_MASK                     equ 0004h
RXFBCON1_F2BP_3_POSN                     equ 0003h
RXFBCON1_F2BP_3_POSITION                 equ 0003h
RXFBCON1_F2BP_3_SIZE                     equ 0001h
RXFBCON1_F2BP_3_LENGTH                   equ 0001h
RXFBCON1_F2BP_3_MASK                     equ 0008h
RXFBCON1_F3BP_0_POSN                     equ 0004h
RXFBCON1_F3BP_0_POSITION                 equ 0004h
RXFBCON1_F3BP_0_SIZE                     equ 0001h
RXFBCON1_F3BP_0_LENGTH                   equ 0001h
RXFBCON1_F3BP_0_MASK                     equ 0010h
RXFBCON1_F3BP_1_POSN                     equ 0005h
RXFBCON1_F3BP_1_POSITION                 equ 0005h
RXFBCON1_F3BP_1_SIZE                     equ 0001h
RXFBCON1_F3BP_1_LENGTH                   equ 0001h
RXFBCON1_F3BP_1_MASK                     equ 0020h
RXFBCON1_F3BP_2_POSN                     equ 0006h
RXFBCON1_F3BP_2_POSITION                 equ 0006h
RXFBCON1_F3BP_2_SIZE                     equ 0001h
RXFBCON1_F3BP_2_LENGTH                   equ 0001h
RXFBCON1_F3BP_2_MASK                     equ 0040h
RXFBCON1_F3BP_3_POSN                     equ 0007h
RXFBCON1_F3BP_3_POSITION                 equ 0007h
RXFBCON1_F3BP_3_SIZE                     equ 0001h
RXFBCON1_F3BP_3_LENGTH                   equ 0001h
RXFBCON1_F3BP_3_MASK                     equ 0080h
RXFBCON1_F2BP_01_POSN                    equ 0000h
RXFBCON1_F2BP_01_POSITION                equ 0000h
RXFBCON1_F2BP_01_SIZE                    equ 0001h
RXFBCON1_F2BP_01_LENGTH                  equ 0001h
RXFBCON1_F2BP_01_MASK                    equ 0001h

// Register: RXFBCON2
#define RXFBCON2 RXFBCON2
RXFBCON2                                 equ 0DE2h
// bitfield definitions
RXFBCON2_F4BP_0_POSN                     equ 0000h
RXFBCON2_F4BP_0_POSITION                 equ 0000h
RXFBCON2_F4BP_0_SIZE                     equ 0001h
RXFBCON2_F4BP_0_LENGTH                   equ 0001h
RXFBCON2_F4BP_0_MASK                     equ 0001h
RXFBCON2_F4BP_1_POSN                     equ 0001h
RXFBCON2_F4BP_1_POSITION                 equ 0001h
RXFBCON2_F4BP_1_SIZE                     equ 0001h
RXFBCON2_F4BP_1_LENGTH                   equ 0001h
RXFBCON2_F4BP_1_MASK                     equ 0002h
RXFBCON2_F4BP_2_POSN                     equ 0002h
RXFBCON2_F4BP_2_POSITION                 equ 0002h
RXFBCON2_F4BP_2_SIZE                     equ 0001h
RXFBCON2_F4BP_2_LENGTH                   equ 0001h
RXFBCON2_F4BP_2_MASK                     equ 0004h
RXFBCON2_F4BP_3_POSN                     equ 0003h
RXFBCON2_F4BP_3_POSITION                 equ 0003h
RXFBCON2_F4BP_3_SIZE                     equ 0001h
RXFBCON2_F4BP_3_LENGTH                   equ 0001h
RXFBCON2_F4BP_3_MASK                     equ 0008h
RXFBCON2_F5BP_0_POSN                     equ 0004h
RXFBCON2_F5BP_0_POSITION                 equ 0004h
RXFBCON2_F5BP_0_SIZE                     equ 0001h
RXFBCON2_F5BP_0_LENGTH                   equ 0001h
RXFBCON2_F5BP_0_MASK                     equ 0010h
RXFBCON2_F5BP_1_POSN                     equ 0005h
RXFBCON2_F5BP_1_POSITION                 equ 0005h
RXFBCON2_F5BP_1_SIZE                     equ 0001h
RXFBCON2_F5BP_1_LENGTH                   equ 0001h
RXFBCON2_F5BP_1_MASK                     equ 0020h
RXFBCON2_F5BP_2_POSN                     equ 0006h
RXFBCON2_F5BP_2_POSITION                 equ 0006h
RXFBCON2_F5BP_2_SIZE                     equ 0001h
RXFBCON2_F5BP_2_LENGTH                   equ 0001h
RXFBCON2_F5BP_2_MASK                     equ 0040h
RXFBCON2_F5BP_3_POSN                     equ 0007h
RXFBCON2_F5BP_3_POSITION                 equ 0007h
RXFBCON2_F5BP_3_SIZE                     equ 0001h
RXFBCON2_F5BP_3_LENGTH                   equ 0001h
RXFBCON2_F5BP_3_MASK                     equ 0080h
RXFBCON2_F4BP_01_POSN                    equ 0000h
RXFBCON2_F4BP_01_POSITION                equ 0000h
RXFBCON2_F4BP_01_SIZE                    equ 0001h
RXFBCON2_F4BP_01_LENGTH                  equ 0001h
RXFBCON2_F4BP_01_MASK                    equ 0001h

// Register: RXFBCON3
#define RXFBCON3 RXFBCON3
RXFBCON3                                 equ 0DE3h
// bitfield definitions
RXFBCON3_F6BP_0_POSN                     equ 0000h
RXFBCON3_F6BP_0_POSITION                 equ 0000h
RXFBCON3_F6BP_0_SIZE                     equ 0001h
RXFBCON3_F6BP_0_LENGTH                   equ 0001h
RXFBCON3_F6BP_0_MASK                     equ 0001h
RXFBCON3_F6BP_1_POSN                     equ 0001h
RXFBCON3_F6BP_1_POSITION                 equ 0001h
RXFBCON3_F6BP_1_SIZE                     equ 0001h
RXFBCON3_F6BP_1_LENGTH                   equ 0001h
RXFBCON3_F6BP_1_MASK                     equ 0002h
RXFBCON3_F6BP_2_POSN                     equ 0002h
RXFBCON3_F6BP_2_POSITION                 equ 0002h
RXFBCON3_F6BP_2_SIZE                     equ 0001h
RXFBCON3_F6BP_2_LENGTH                   equ 0001h
RXFBCON3_F6BP_2_MASK                     equ 0004h
RXFBCON3_F6BP_3_POSN                     equ 0003h
RXFBCON3_F6BP_3_POSITION                 equ 0003h
RXFBCON3_F6BP_3_SIZE                     equ 0001h
RXFBCON3_F6BP_3_LENGTH                   equ 0001h
RXFBCON3_F6BP_3_MASK                     equ 0008h
RXFBCON3_F7BP_0_POSN                     equ 0004h
RXFBCON3_F7BP_0_POSITION                 equ 0004h
RXFBCON3_F7BP_0_SIZE                     equ 0001h
RXFBCON3_F7BP_0_LENGTH                   equ 0001h
RXFBCON3_F7BP_0_MASK                     equ 0010h
RXFBCON3_F7BP_1_POSN                     equ 0005h
RXFBCON3_F7BP_1_POSITION                 equ 0005h
RXFBCON3_F7BP_1_SIZE                     equ 0001h
RXFBCON3_F7BP_1_LENGTH                   equ 0001h
RXFBCON3_F7BP_1_MASK                     equ 0020h
RXFBCON3_F7BP_2_POSN                     equ 0006h
RXFBCON3_F7BP_2_POSITION                 equ 0006h
RXFBCON3_F7BP_2_SIZE                     equ 0001h
RXFBCON3_F7BP_2_LENGTH                   equ 0001h
RXFBCON3_F7BP_2_MASK                     equ 0040h
RXFBCON3_F7BP_3_POSN                     equ 0007h
RXFBCON3_F7BP_3_POSITION                 equ 0007h
RXFBCON3_F7BP_3_SIZE                     equ 0001h
RXFBCON3_F7BP_3_LENGTH                   equ 0001h
RXFBCON3_F7BP_3_MASK                     equ 0080h
RXFBCON3_F6BP_01_POSN                    equ 0000h
RXFBCON3_F6BP_01_POSITION                equ 0000h
RXFBCON3_F6BP_01_SIZE                    equ 0001h
RXFBCON3_F6BP_01_LENGTH                  equ 0001h
RXFBCON3_F6BP_01_MASK                    equ 0001h

// Register: RXFBCON4
#define RXFBCON4 RXFBCON4
RXFBCON4                                 equ 0DE4h
// bitfield definitions
RXFBCON4_F8BP_0_POSN                     equ 0000h
RXFBCON4_F8BP_0_POSITION                 equ 0000h
RXFBCON4_F8BP_0_SIZE                     equ 0001h
RXFBCON4_F8BP_0_LENGTH                   equ 0001h
RXFBCON4_F8BP_0_MASK                     equ 0001h
RXFBCON4_F8BP_1_POSN                     equ 0001h
RXFBCON4_F8BP_1_POSITION                 equ 0001h
RXFBCON4_F8BP_1_SIZE                     equ 0001h
RXFBCON4_F8BP_1_LENGTH                   equ 0001h
RXFBCON4_F8BP_1_MASK                     equ 0002h
RXFBCON4_F8BP_2_POSN                     equ 0002h
RXFBCON4_F8BP_2_POSITION                 equ 0002h
RXFBCON4_F8BP_2_SIZE                     equ 0001h
RXFBCON4_F8BP_2_LENGTH                   equ 0001h
RXFBCON4_F8BP_2_MASK                     equ 0004h
RXFBCON4_F8BP_3_POSN                     equ 0003h
RXFBCON4_F8BP_3_POSITION                 equ 0003h
RXFBCON4_F8BP_3_SIZE                     equ 0001h
RXFBCON4_F8BP_3_LENGTH                   equ 0001h
RXFBCON4_F8BP_3_MASK                     equ 0008h
RXFBCON4_F9BP_0_POSN                     equ 0004h
RXFBCON4_F9BP_0_POSITION                 equ 0004h
RXFBCON4_F9BP_0_SIZE                     equ 0001h
RXFBCON4_F9BP_0_LENGTH                   equ 0001h
RXFBCON4_F9BP_0_MASK                     equ 0010h
RXFBCON4_F9BP_1_POSN                     equ 0005h
RXFBCON4_F9BP_1_POSITION                 equ 0005h
RXFBCON4_F9BP_1_SIZE                     equ 0001h
RXFBCON4_F9BP_1_LENGTH                   equ 0001h
RXFBCON4_F9BP_1_MASK                     equ 0020h
RXFBCON4_F9BP_2_POSN                     equ 0006h
RXFBCON4_F9BP_2_POSITION                 equ 0006h
RXFBCON4_F9BP_2_SIZE                     equ 0001h
RXFBCON4_F9BP_2_LENGTH                   equ 0001h
RXFBCON4_F9BP_2_MASK                     equ 0040h
RXFBCON4_F9BP_3_POSN                     equ 0007h
RXFBCON4_F9BP_3_POSITION                 equ 0007h
RXFBCON4_F9BP_3_SIZE                     equ 0001h
RXFBCON4_F9BP_3_LENGTH                   equ 0001h
RXFBCON4_F9BP_3_MASK                     equ 0080h
RXFBCON4_F8BP_01_POSN                    equ 0000h
RXFBCON4_F8BP_01_POSITION                equ 0000h
RXFBCON4_F8BP_01_SIZE                    equ 0001h
RXFBCON4_F8BP_01_LENGTH                  equ 0001h
RXFBCON4_F8BP_01_MASK                    equ 0001h

// Register: RXFBCON5
#define RXFBCON5 RXFBCON5
RXFBCON5                                 equ 0DE5h
// bitfield definitions
RXFBCON5_F10BP_0_POSN                    equ 0000h
RXFBCON5_F10BP_0_POSITION                equ 0000h
RXFBCON5_F10BP_0_SIZE                    equ 0001h
RXFBCON5_F10BP_0_LENGTH                  equ 0001h
RXFBCON5_F10BP_0_MASK                    equ 0001h
RXFBCON5_F10BP_1_POSN                    equ 0001h
RXFBCON5_F10BP_1_POSITION                equ 0001h
RXFBCON5_F10BP_1_SIZE                    equ 0001h
RXFBCON5_F10BP_1_LENGTH                  equ 0001h
RXFBCON5_F10BP_1_MASK                    equ 0002h
RXFBCON5_F10BP_2_POSN                    equ 0002h
RXFBCON5_F10BP_2_POSITION                equ 0002h
RXFBCON5_F10BP_2_SIZE                    equ 0001h
RXFBCON5_F10BP_2_LENGTH                  equ 0001h
RXFBCON5_F10BP_2_MASK                    equ 0004h
RXFBCON5_F10BP_3_POSN                    equ 0003h
RXFBCON5_F10BP_3_POSITION                equ 0003h
RXFBCON5_F10BP_3_SIZE                    equ 0001h
RXFBCON5_F10BP_3_LENGTH                  equ 0001h
RXFBCON5_F10BP_3_MASK                    equ 0008h
RXFBCON5_F11BP_0_POSN                    equ 0004h
RXFBCON5_F11BP_0_POSITION                equ 0004h
RXFBCON5_F11BP_0_SIZE                    equ 0001h
RXFBCON5_F11BP_0_LENGTH                  equ 0001h
RXFBCON5_F11BP_0_MASK                    equ 0010h
RXFBCON5_F11BP_1_POSN                    equ 0005h
RXFBCON5_F11BP_1_POSITION                equ 0005h
RXFBCON5_F11BP_1_SIZE                    equ 0001h
RXFBCON5_F11BP_1_LENGTH                  equ 0001h
RXFBCON5_F11BP_1_MASK                    equ 0020h
RXFBCON5_F11BP_2_POSN                    equ 0006h
RXFBCON5_F11BP_2_POSITION                equ 0006h
RXFBCON5_F11BP_2_SIZE                    equ 0001h
RXFBCON5_F11BP_2_LENGTH                  equ 0001h
RXFBCON5_F11BP_2_MASK                    equ 0040h
RXFBCON5_F11BP_3_POSN                    equ 0007h
RXFBCON5_F11BP_3_POSITION                equ 0007h
RXFBCON5_F11BP_3_SIZE                    equ 0001h
RXFBCON5_F11BP_3_LENGTH                  equ 0001h
RXFBCON5_F11BP_3_MASK                    equ 0080h
RXFBCON5_F10BP_01_POSN                   equ 0000h
RXFBCON5_F10BP_01_POSITION               equ 0000h
RXFBCON5_F10BP_01_SIZE                   equ 0001h
RXFBCON5_F10BP_01_LENGTH                 equ 0001h
RXFBCON5_F10BP_01_MASK                   equ 0001h

// Register: RXFBCON6
#define RXFBCON6 RXFBCON6
RXFBCON6                                 equ 0DE6h
// bitfield definitions
RXFBCON6_F12BP_0_POSN                    equ 0000h
RXFBCON6_F12BP_0_POSITION                equ 0000h
RXFBCON6_F12BP_0_SIZE                    equ 0001h
RXFBCON6_F12BP_0_LENGTH                  equ 0001h
RXFBCON6_F12BP_0_MASK                    equ 0001h
RXFBCON6_F12BP_1_POSN                    equ 0001h
RXFBCON6_F12BP_1_POSITION                equ 0001h
RXFBCON6_F12BP_1_SIZE                    equ 0001h
RXFBCON6_F12BP_1_LENGTH                  equ 0001h
RXFBCON6_F12BP_1_MASK                    equ 0002h
RXFBCON6_F12BP_2_POSN                    equ 0002h
RXFBCON6_F12BP_2_POSITION                equ 0002h
RXFBCON6_F12BP_2_SIZE                    equ 0001h
RXFBCON6_F12BP_2_LENGTH                  equ 0001h
RXFBCON6_F12BP_2_MASK                    equ 0004h
RXFBCON6_F12BP_3_POSN                    equ 0003h
RXFBCON6_F12BP_3_POSITION                equ 0003h
RXFBCON6_F12BP_3_SIZE                    equ 0001h
RXFBCON6_F12BP_3_LENGTH                  equ 0001h
RXFBCON6_F12BP_3_MASK                    equ 0008h
RXFBCON6_F13BP_0_POSN                    equ 0004h
RXFBCON6_F13BP_0_POSITION                equ 0004h
RXFBCON6_F13BP_0_SIZE                    equ 0001h
RXFBCON6_F13BP_0_LENGTH                  equ 0001h
RXFBCON6_F13BP_0_MASK                    equ 0010h
RXFBCON6_F13BP_1_POSN                    equ 0005h
RXFBCON6_F13BP_1_POSITION                equ 0005h
RXFBCON6_F13BP_1_SIZE                    equ 0001h
RXFBCON6_F13BP_1_LENGTH                  equ 0001h
RXFBCON6_F13BP_1_MASK                    equ 0020h
RXFBCON6_F13BP_2_POSN                    equ 0006h
RXFBCON6_F13BP_2_POSITION                equ 0006h
RXFBCON6_F13BP_2_SIZE                    equ 0001h
RXFBCON6_F13BP_2_LENGTH                  equ 0001h
RXFBCON6_F13BP_2_MASK                    equ 0040h
RXFBCON6_F13BP_3_POSN                    equ 0007h
RXFBCON6_F13BP_3_POSITION                equ 0007h
RXFBCON6_F13BP_3_SIZE                    equ 0001h
RXFBCON6_F13BP_3_LENGTH                  equ 0001h
RXFBCON6_F13BP_3_MASK                    equ 0080h
RXFBCON6_F12BP_01_POSN                   equ 0000h
RXFBCON6_F12BP_01_POSITION               equ 0000h
RXFBCON6_F12BP_01_SIZE                   equ 0001h
RXFBCON6_F12BP_01_LENGTH                 equ 0001h
RXFBCON6_F12BP_01_MASK                   equ 0001h

// Register: RXFBCON7
#define RXFBCON7 RXFBCON7
RXFBCON7                                 equ 0DE7h
// bitfield definitions
RXFBCON7_F14BP_0_POSN                    equ 0000h
RXFBCON7_F14BP_0_POSITION                equ 0000h
RXFBCON7_F14BP_0_SIZE                    equ 0001h
RXFBCON7_F14BP_0_LENGTH                  equ 0001h
RXFBCON7_F14BP_0_MASK                    equ 0001h
RXFBCON7_F14BP_1_POSN                    equ 0001h
RXFBCON7_F14BP_1_POSITION                equ 0001h
RXFBCON7_F14BP_1_SIZE                    equ 0001h
RXFBCON7_F14BP_1_LENGTH                  equ 0001h
RXFBCON7_F14BP_1_MASK                    equ 0002h
RXFBCON7_F14BP_2_POSN                    equ 0002h
RXFBCON7_F14BP_2_POSITION                equ 0002h
RXFBCON7_F14BP_2_SIZE                    equ 0001h
RXFBCON7_F14BP_2_LENGTH                  equ 0001h
RXFBCON7_F14BP_2_MASK                    equ 0004h
RXFBCON7_F14BP_3_POSN                    equ 0003h
RXFBCON7_F14BP_3_POSITION                equ 0003h
RXFBCON7_F14BP_3_SIZE                    equ 0001h
RXFBCON7_F14BP_3_LENGTH                  equ 0001h
RXFBCON7_F14BP_3_MASK                    equ 0008h
RXFBCON7_F15BP_0_POSN                    equ 0004h
RXFBCON7_F15BP_0_POSITION                equ 0004h
RXFBCON7_F15BP_0_SIZE                    equ 0001h
RXFBCON7_F15BP_0_LENGTH                  equ 0001h
RXFBCON7_F15BP_0_MASK                    equ 0010h
RXFBCON7_F15BP_1_POSN                    equ 0005h
RXFBCON7_F15BP_1_POSITION                equ 0005h
RXFBCON7_F15BP_1_SIZE                    equ 0001h
RXFBCON7_F15BP_1_LENGTH                  equ 0001h
RXFBCON7_F15BP_1_MASK                    equ 0020h
RXFBCON7_F15BP_2_POSN                    equ 0006h
RXFBCON7_F15BP_2_POSITION                equ 0006h
RXFBCON7_F15BP_2_SIZE                    equ 0001h
RXFBCON7_F15BP_2_LENGTH                  equ 0001h
RXFBCON7_F15BP_2_MASK                    equ 0040h
RXFBCON7_F15BP_3_POSN                    equ 0007h
RXFBCON7_F15BP_3_POSITION                equ 0007h
RXFBCON7_F15BP_3_SIZE                    equ 0001h
RXFBCON7_F15BP_3_LENGTH                  equ 0001h
RXFBCON7_F15BP_3_MASK                    equ 0080h
RXFBCON7_F14BP_01_POSN                   equ 0000h
RXFBCON7_F14BP_01_POSITION               equ 0000h
RXFBCON7_F14BP_01_SIZE                   equ 0001h
RXFBCON7_F14BP_01_LENGTH                 equ 0001h
RXFBCON7_F14BP_01_MASK                   equ 0001h

// Register: MSEL0
#define MSEL0 MSEL0
MSEL0                                    equ 0DF0h
// bitfield definitions
MSEL0_FIL0_0_POSN                        equ 0000h
MSEL0_FIL0_0_POSITION                    equ 0000h
MSEL0_FIL0_0_SIZE                        equ 0001h
MSEL0_FIL0_0_LENGTH                      equ 0001h
MSEL0_FIL0_0_MASK                        equ 0001h
MSEL0_FIL0_1_POSN                        equ 0001h
MSEL0_FIL0_1_POSITION                    equ 0001h
MSEL0_FIL0_1_SIZE                        equ 0001h
MSEL0_FIL0_1_LENGTH                      equ 0001h
MSEL0_FIL0_1_MASK                        equ 0002h
MSEL0_FIL1_0_POSN                        equ 0002h
MSEL0_FIL1_0_POSITION                    equ 0002h
MSEL0_FIL1_0_SIZE                        equ 0001h
MSEL0_FIL1_0_LENGTH                      equ 0001h
MSEL0_FIL1_0_MASK                        equ 0004h
MSEL0_FIL1_1_POSN                        equ 0003h
MSEL0_FIL1_1_POSITION                    equ 0003h
MSEL0_FIL1_1_SIZE                        equ 0001h
MSEL0_FIL1_1_LENGTH                      equ 0001h
MSEL0_FIL1_1_MASK                        equ 0008h
MSEL0_FIL2_0_POSN                        equ 0004h
MSEL0_FIL2_0_POSITION                    equ 0004h
MSEL0_FIL2_0_SIZE                        equ 0001h
MSEL0_FIL2_0_LENGTH                      equ 0001h
MSEL0_FIL2_0_MASK                        equ 0010h
MSEL0_FIL2_1_POSN                        equ 0005h
MSEL0_FIL2_1_POSITION                    equ 0005h
MSEL0_FIL2_1_SIZE                        equ 0001h
MSEL0_FIL2_1_LENGTH                      equ 0001h
MSEL0_FIL2_1_MASK                        equ 0020h
MSEL0_FIL3_0_POSN                        equ 0006h
MSEL0_FIL3_0_POSITION                    equ 0006h
MSEL0_FIL3_0_SIZE                        equ 0001h
MSEL0_FIL3_0_LENGTH                      equ 0001h
MSEL0_FIL3_0_MASK                        equ 0040h
MSEL0_FIL3_1_POSN                        equ 0007h
MSEL0_FIL3_1_POSITION                    equ 0007h
MSEL0_FIL3_1_SIZE                        equ 0001h
MSEL0_FIL3_1_LENGTH                      equ 0001h
MSEL0_FIL3_1_MASK                        equ 0080h

// Register: MSEL1
#define MSEL1 MSEL1
MSEL1                                    equ 0DF1h
// bitfield definitions
MSEL1_FIL4_0_POSN                        equ 0000h
MSEL1_FIL4_0_POSITION                    equ 0000h
MSEL1_FIL4_0_SIZE                        equ 0001h
MSEL1_FIL4_0_LENGTH                      equ 0001h
MSEL1_FIL4_0_MASK                        equ 0001h
MSEL1_FIL4_1_POSN                        equ 0001h
MSEL1_FIL4_1_POSITION                    equ 0001h
MSEL1_FIL4_1_SIZE                        equ 0001h
MSEL1_FIL4_1_LENGTH                      equ 0001h
MSEL1_FIL4_1_MASK                        equ 0002h
MSEL1_FIL5_0_POSN                        equ 0002h
MSEL1_FIL5_0_POSITION                    equ 0002h
MSEL1_FIL5_0_SIZE                        equ 0001h
MSEL1_FIL5_0_LENGTH                      equ 0001h
MSEL1_FIL5_0_MASK                        equ 0004h
MSEL1_FIL5_1_POSN                        equ 0003h
MSEL1_FIL5_1_POSITION                    equ 0003h
MSEL1_FIL5_1_SIZE                        equ 0001h
MSEL1_FIL5_1_LENGTH                      equ 0001h
MSEL1_FIL5_1_MASK                        equ 0008h
MSEL1_FIL6_0_POSN                        equ 0004h
MSEL1_FIL6_0_POSITION                    equ 0004h
MSEL1_FIL6_0_SIZE                        equ 0001h
MSEL1_FIL6_0_LENGTH                      equ 0001h
MSEL1_FIL6_0_MASK                        equ 0010h
MSEL1_FIL6_1_POSN                        equ 0005h
MSEL1_FIL6_1_POSITION                    equ 0005h
MSEL1_FIL6_1_SIZE                        equ 0001h
MSEL1_FIL6_1_LENGTH                      equ 0001h
MSEL1_FIL6_1_MASK                        equ 0020h
MSEL1_FIL7_0_POSN                        equ 0006h
MSEL1_FIL7_0_POSITION                    equ 0006h
MSEL1_FIL7_0_SIZE                        equ 0001h
MSEL1_FIL7_0_LENGTH                      equ 0001h
MSEL1_FIL7_0_MASK                        equ 0040h
MSEL1_FIL7_1_POSN                        equ 0007h
MSEL1_FIL7_1_POSITION                    equ 0007h
MSEL1_FIL7_1_SIZE                        equ 0001h
MSEL1_FIL7_1_LENGTH                      equ 0001h
MSEL1_FIL7_1_MASK                        equ 0080h

// Register: MSEL2
#define MSEL2 MSEL2
MSEL2                                    equ 0DF2h
// bitfield definitions
MSEL2_FIL8_0_POSN                        equ 0000h
MSEL2_FIL8_0_POSITION                    equ 0000h
MSEL2_FIL8_0_SIZE                        equ 0001h
MSEL2_FIL8_0_LENGTH                      equ 0001h
MSEL2_FIL8_0_MASK                        equ 0001h
MSEL2_FIL8_1_POSN                        equ 0001h
MSEL2_FIL8_1_POSITION                    equ 0001h
MSEL2_FIL8_1_SIZE                        equ 0001h
MSEL2_FIL8_1_LENGTH                      equ 0001h
MSEL2_FIL8_1_MASK                        equ 0002h
MSEL2_FIL9_0_POSN                        equ 0002h
MSEL2_FIL9_0_POSITION                    equ 0002h
MSEL2_FIL9_0_SIZE                        equ 0001h
MSEL2_FIL9_0_LENGTH                      equ 0001h
MSEL2_FIL9_0_MASK                        equ 0004h
MSEL2_FIL9_1_POSN                        equ 0003h
MSEL2_FIL9_1_POSITION                    equ 0003h
MSEL2_FIL9_1_SIZE                        equ 0001h
MSEL2_FIL9_1_LENGTH                      equ 0001h
MSEL2_FIL9_1_MASK                        equ 0008h
MSEL2_FIL10_0_POSN                       equ 0004h
MSEL2_FIL10_0_POSITION                   equ 0004h
MSEL2_FIL10_0_SIZE                       equ 0001h
MSEL2_FIL10_0_LENGTH                     equ 0001h
MSEL2_FIL10_0_MASK                       equ 0010h
MSEL2_FIL10_1_POSN                       equ 0005h
MSEL2_FIL10_1_POSITION                   equ 0005h
MSEL2_FIL10_1_SIZE                       equ 0001h
MSEL2_FIL10_1_LENGTH                     equ 0001h
MSEL2_FIL10_1_MASK                       equ 0020h
MSEL2_FIL11_0_POSN                       equ 0006h
MSEL2_FIL11_0_POSITION                   equ 0006h
MSEL2_FIL11_0_SIZE                       equ 0001h
MSEL2_FIL11_0_LENGTH                     equ 0001h
MSEL2_FIL11_0_MASK                       equ 0040h
MSEL2_FIL11_1_POSN                       equ 0007h
MSEL2_FIL11_1_POSITION                   equ 0007h
MSEL2_FIL11_1_SIZE                       equ 0001h
MSEL2_FIL11_1_LENGTH                     equ 0001h
MSEL2_FIL11_1_MASK                       equ 0080h

