GopalSaraf/Practicals/PSDL/include/proc/pic18f2580.inc
// Register: RXF4SIDH
#define RXF4SIDH RXF4SIDH
RXF4SIDH                                 equ 0F10h
// bitfield definitions
RXF4SIDH_SID3_POSN                       equ 0000h
RXF4SIDH_SID3_POSITION                   equ 0000h
RXF4SIDH_SID3_SIZE                       equ 0001h
RXF4SIDH_SID3_LENGTH                     equ 0001h
RXF4SIDH_SID3_MASK                       equ 0001h
RXF4SIDH_SID4_POSN                       equ 0001h
RXF4SIDH_SID4_POSITION                   equ 0001h
RXF4SIDH_SID4_SIZE                       equ 0001h
RXF4SIDH_SID4_LENGTH                     equ 0001h
RXF4SIDH_SID4_MASK                       equ 0002h
RXF4SIDH_SID5_POSN                       equ 0002h
RXF4SIDH_SID5_POSITION                   equ 0002h
RXF4SIDH_SID5_SIZE                       equ 0001h
RXF4SIDH_SID5_LENGTH                     equ 0001h
RXF4SIDH_SID5_MASK                       equ 0004h
RXF4SIDH_SID6_POSN                       equ 0003h
RXF4SIDH_SID6_POSITION                   equ 0003h
RXF4SIDH_SID6_SIZE                       equ 0001h
RXF4SIDH_SID6_LENGTH                     equ 0001h
RXF4SIDH_SID6_MASK                       equ 0008h
RXF4SIDH_SID7_POSN                       equ 0004h
RXF4SIDH_SID7_POSITION                   equ 0004h
RXF4SIDH_SID7_SIZE                       equ 0001h
RXF4SIDH_SID7_LENGTH                     equ 0001h
RXF4SIDH_SID7_MASK                       equ 0010h
RXF4SIDH_SID8_POSN                       equ 0005h
RXF4SIDH_SID8_POSITION                   equ 0005h
RXF4SIDH_SID8_SIZE                       equ 0001h
RXF4SIDH_SID8_LENGTH                     equ 0001h
RXF4SIDH_SID8_MASK                       equ 0020h
RXF4SIDH_SID9_POSN                       equ 0006h
RXF4SIDH_SID9_POSITION                   equ 0006h
RXF4SIDH_SID9_SIZE                       equ 0001h
RXF4SIDH_SID9_LENGTH                     equ 0001h
RXF4SIDH_SID9_MASK                       equ 0040h
RXF4SIDH_SID10_POSN                      equ 0007h
RXF4SIDH_SID10_POSITION                  equ 0007h
RXF4SIDH_SID10_SIZE                      equ 0001h
RXF4SIDH_SID10_LENGTH                    equ 0001h
RXF4SIDH_SID10_MASK                      equ 0080h
RXF4SIDH_RXF4SID3_POSN                   equ 0000h
RXF4SIDH_RXF4SID3_POSITION               equ 0000h
RXF4SIDH_RXF4SID3_SIZE                   equ 0001h
RXF4SIDH_RXF4SID3_LENGTH                 equ 0001h
RXF4SIDH_RXF4SID3_MASK                   equ 0001h
RXF4SIDH_RXF4SID4_POSN                   equ 0001h
RXF4SIDH_RXF4SID4_POSITION               equ 0001h
RXF4SIDH_RXF4SID4_SIZE                   equ 0001h
RXF4SIDH_RXF4SID4_LENGTH                 equ 0001h
RXF4SIDH_RXF4SID4_MASK                   equ 0002h
RXF4SIDH_RXF4SID5_POSN                   equ 0002h
RXF4SIDH_RXF4SID5_POSITION               equ 0002h
RXF4SIDH_RXF4SID5_SIZE                   equ 0001h
RXF4SIDH_RXF4SID5_LENGTH                 equ 0001h
RXF4SIDH_RXF4SID5_MASK                   equ 0004h
RXF4SIDH_RXF4SID6_POSN                   equ 0003h
RXF4SIDH_RXF4SID6_POSITION               equ 0003h
RXF4SIDH_RXF4SID6_SIZE                   equ 0001h
RXF4SIDH_RXF4SID6_LENGTH                 equ 0001h
RXF4SIDH_RXF4SID6_MASK                   equ 0008h
RXF4SIDH_RXF4SID7_POSN                   equ 0004h
RXF4SIDH_RXF4SID7_POSITION               equ 0004h
RXF4SIDH_RXF4SID7_SIZE                   equ 0001h
RXF4SIDH_RXF4SID7_LENGTH                 equ 0001h
RXF4SIDH_RXF4SID7_MASK                   equ 0010h
RXF4SIDH_RXF4SID8_POSN                   equ 0005h
RXF4SIDH_RXF4SID8_POSITION               equ 0005h
RXF4SIDH_RXF4SID8_SIZE                   equ 0001h
RXF4SIDH_RXF4SID8_LENGTH                 equ 0001h
RXF4SIDH_RXF4SID8_MASK                   equ 0020h
RXF4SIDH_RXF4SID9_POSN                   equ 0006h
RXF4SIDH_RXF4SID9_POSITION               equ 0006h
RXF4SIDH_RXF4SID9_SIZE                   equ 0001h
RXF4SIDH_RXF4SID9_LENGTH                 equ 0001h
RXF4SIDH_RXF4SID9_MASK                   equ 0040h
RXF4SIDH_RXF4SID10_POSN                  equ 0007h
RXF4SIDH_RXF4SID10_POSITION              equ 0007h
RXF4SIDH_RXF4SID10_SIZE                  equ 0001h
RXF4SIDH_RXF4SID10_LENGTH                equ 0001h
RXF4SIDH_RXF4SID10_MASK                  equ 0080h

// Register: RXF4SIDL
#define RXF4SIDL RXF4SIDL
RXF4SIDL                                 equ 0F11h
// bitfield definitions
RXF4SIDL_EID16_POSN                      equ 0000h
RXF4SIDL_EID16_POSITION                  equ 0000h
RXF4SIDL_EID16_SIZE                      equ 0001h
RXF4SIDL_EID16_LENGTH                    equ 0001h
RXF4SIDL_EID16_MASK                      equ 0001h
RXF4SIDL_EID17_POSN                      equ 0001h
RXF4SIDL_EID17_POSITION                  equ 0001h
RXF4SIDL_EID17_SIZE                      equ 0001h
RXF4SIDL_EID17_LENGTH                    equ 0001h
RXF4SIDL_EID17_MASK                      equ 0002h
RXF4SIDL_EXIDEN_POSN                     equ 0003h
RXF4SIDL_EXIDEN_POSITION                 equ 0003h
RXF4SIDL_EXIDEN_SIZE                     equ 0001h
RXF4SIDL_EXIDEN_LENGTH                   equ 0001h
RXF4SIDL_EXIDEN_MASK                     equ 0008h
RXF4SIDL_SID0_POSN                       equ 0005h
RXF4SIDL_SID0_POSITION                   equ 0005h
RXF4SIDL_SID0_SIZE                       equ 0001h
RXF4SIDL_SID0_LENGTH                     equ 0001h
RXF4SIDL_SID0_MASK                       equ 0020h
RXF4SIDL_SID1_POSN                       equ 0006h
RXF4SIDL_SID1_POSITION                   equ 0006h
RXF4SIDL_SID1_SIZE                       equ 0001h
RXF4SIDL_SID1_LENGTH                     equ 0001h
RXF4SIDL_SID1_MASK                       equ 0040h
RXF4SIDL_SID2_POSN                       equ 0007h
RXF4SIDL_SID2_POSITION                   equ 0007h
RXF4SIDL_SID2_SIZE                       equ 0001h
RXF4SIDL_SID2_LENGTH                     equ 0001h
RXF4SIDL_SID2_MASK                       equ 0080h
RXF4SIDL_EXIDE_POSN                      equ 0003h
RXF4SIDL_EXIDE_POSITION                  equ 0003h
RXF4SIDL_EXIDE_SIZE                      equ 0001h
RXF4SIDL_EXIDE_LENGTH                    equ 0001h
RXF4SIDL_EXIDE_MASK                      equ 0008h
RXF4SIDL_RXF4EID16_POSN                  equ 0000h
RXF4SIDL_RXF4EID16_POSITION              equ 0000h
RXF4SIDL_RXF4EID16_SIZE                  equ 0001h
RXF4SIDL_RXF4EID16_LENGTH                equ 0001h
RXF4SIDL_RXF4EID16_MASK                  equ 0001h
RXF4SIDL_RXF4EID17_POSN                  equ 0001h
RXF4SIDL_RXF4EID17_POSITION              equ 0001h
RXF4SIDL_RXF4EID17_SIZE                  equ 0001h
RXF4SIDL_RXF4EID17_LENGTH                equ 0001h
RXF4SIDL_RXF4EID17_MASK                  equ 0002h
RXF4SIDL_RXF4EXIDEN_POSN                 equ 0003h
RXF4SIDL_RXF4EXIDEN_POSITION             equ 0003h
RXF4SIDL_RXF4EXIDEN_SIZE                 equ 0001h
RXF4SIDL_RXF4EXIDEN_LENGTH               equ 0001h
RXF4SIDL_RXF4EXIDEN_MASK                 equ 0008h
RXF4SIDL_RXF4SID0_POSN                   equ 0005h
RXF4SIDL_RXF4SID0_POSITION               equ 0005h
RXF4SIDL_RXF4SID0_SIZE                   equ 0001h
RXF4SIDL_RXF4SID0_LENGTH                 equ 0001h
RXF4SIDL_RXF4SID0_MASK                   equ 0020h
RXF4SIDL_RXF4SID1_POSN                   equ 0006h
RXF4SIDL_RXF4SID1_POSITION               equ 0006h
RXF4SIDL_RXF4SID1_SIZE                   equ 0001h
RXF4SIDL_RXF4SID1_LENGTH                 equ 0001h
RXF4SIDL_RXF4SID1_MASK                   equ 0040h
RXF4SIDL_RXF4SID2_POSN                   equ 0007h
RXF4SIDL_RXF4SID2_POSITION               equ 0007h
RXF4SIDL_RXF4SID2_SIZE                   equ 0001h
RXF4SIDL_RXF4SID2_LENGTH                 equ 0001h
RXF4SIDL_RXF4SID2_MASK                   equ 0080h

// Register: RXF4EIDH
#define RXF4EIDH RXF4EIDH
RXF4EIDH                                 equ 0F12h
// bitfield definitions
RXF4EIDH_EID8_POSN                       equ 0000h
RXF4EIDH_EID8_POSITION                   equ 0000h
RXF4EIDH_EID8_SIZE                       equ 0001h
RXF4EIDH_EID8_LENGTH                     equ 0001h
RXF4EIDH_EID8_MASK                       equ 0001h
RXF4EIDH_EID9_POSN                       equ 0001h
RXF4EIDH_EID9_POSITION                   equ 0001h
RXF4EIDH_EID9_SIZE                       equ 0001h
RXF4EIDH_EID9_LENGTH                     equ 0001h
RXF4EIDH_EID9_MASK                       equ 0002h
RXF4EIDH_EID10_POSN                      equ 0002h
RXF4EIDH_EID10_POSITION                  equ 0002h
RXF4EIDH_EID10_SIZE                      equ 0001h
RXF4EIDH_EID10_LENGTH                    equ 0001h
RXF4EIDH_EID10_MASK                      equ 0004h
RXF4EIDH_EID11_POSN                      equ 0003h
RXF4EIDH_EID11_POSITION                  equ 0003h
RXF4EIDH_EID11_SIZE                      equ 0001h
RXF4EIDH_EID11_LENGTH                    equ 0001h
RXF4EIDH_EID11_MASK                      equ 0008h
RXF4EIDH_EID12_POSN                      equ 0004h
RXF4EIDH_EID12_POSITION                  equ 0004h
RXF4EIDH_EID12_SIZE                      equ 0001h
RXF4EIDH_EID12_LENGTH                    equ 0001h
RXF4EIDH_EID12_MASK                      equ 0010h
RXF4EIDH_EID13_POSN                      equ 0005h
RXF4EIDH_EID13_POSITION                  equ 0005h
RXF4EIDH_EID13_SIZE                      equ 0001h
RXF4EIDH_EID13_LENGTH                    equ 0001h
RXF4EIDH_EID13_MASK                      equ 0020h
RXF4EIDH_EID14_POSN                      equ 0006h
RXF4EIDH_EID14_POSITION                  equ 0006h
RXF4EIDH_EID14_SIZE                      equ 0001h
RXF4EIDH_EID14_LENGTH                    equ 0001h
RXF4EIDH_EID14_MASK                      equ 0040h
RXF4EIDH_EID15_POSN                      equ 0007h
RXF4EIDH_EID15_POSITION                  equ 0007h
RXF4EIDH_EID15_SIZE                      equ 0001h
RXF4EIDH_EID15_LENGTH                    equ 0001h
RXF4EIDH_EID15_MASK                      equ 0080h
RXF4EIDH_RXF4EID8_POSN                   equ 0000h
RXF4EIDH_RXF4EID8_POSITION               equ 0000h
RXF4EIDH_RXF4EID8_SIZE                   equ 0001h
RXF4EIDH_RXF4EID8_LENGTH                 equ 0001h
RXF4EIDH_RXF4EID8_MASK                   equ 0001h
RXF4EIDH_RXF4EID9_POSN                   equ 0001h
RXF4EIDH_RXF4EID9_POSITION               equ 0001h
RXF4EIDH_RXF4EID9_SIZE                   equ 0001h
RXF4EIDH_RXF4EID9_LENGTH                 equ 0001h
RXF4EIDH_RXF4EID9_MASK                   equ 0002h
RXF4EIDH_RXF4EID10_POSN                  equ 0002h
RXF4EIDH_RXF4EID10_POSITION              equ 0002h
RXF4EIDH_RXF4EID10_SIZE                  equ 0001h
RXF4EIDH_RXF4EID10_LENGTH                equ 0001h
RXF4EIDH_RXF4EID10_MASK                  equ 0004h
RXF4EIDH_RXF4EID11_POSN                  equ 0003h
RXF4EIDH_RXF4EID11_POSITION              equ 0003h
RXF4EIDH_RXF4EID11_SIZE                  equ 0001h
RXF4EIDH_RXF4EID11_LENGTH                equ 0001h
RXF4EIDH_RXF4EID11_MASK                  equ 0008h
RXF4EIDH_RXF4EID12_POSN                  equ 0004h
RXF4EIDH_RXF4EID12_POSITION              equ 0004h
RXF4EIDH_RXF4EID12_SIZE                  equ 0001h
RXF4EIDH_RXF4EID12_LENGTH                equ 0001h
RXF4EIDH_RXF4EID12_MASK                  equ 0010h
RXF4EIDH_RXF4EID13_POSN                  equ 0005h
RXF4EIDH_RXF4EID13_POSITION              equ 0005h
RXF4EIDH_RXF4EID13_SIZE                  equ 0001h
RXF4EIDH_RXF4EID13_LENGTH                equ 0001h
RXF4EIDH_RXF4EID13_MASK                  equ 0020h
RXF4EIDH_RXF4EID14_POSN                  equ 0006h
RXF4EIDH_RXF4EID14_POSITION              equ 0006h
RXF4EIDH_RXF4EID14_SIZE                  equ 0001h
RXF4EIDH_RXF4EID14_LENGTH                equ 0001h
RXF4EIDH_RXF4EID14_MASK                  equ 0040h
RXF4EIDH_RXF4EID15_POSN                  equ 0007h
RXF4EIDH_RXF4EID15_POSITION              equ 0007h
RXF4EIDH_RXF4EID15_SIZE                  equ 0001h
RXF4EIDH_RXF4EID15_LENGTH                equ 0001h
RXF4EIDH_RXF4EID15_MASK                  equ 0080h

// Register: RXF4EIDL
#define RXF4EIDL RXF4EIDL
RXF4EIDL                                 equ 0F13h
// bitfield definitions
RXF4EIDL_EID0_POSN                       equ 0000h
RXF4EIDL_EID0_POSITION                   equ 0000h
RXF4EIDL_EID0_SIZE                       equ 0001h
RXF4EIDL_EID0_LENGTH                     equ 0001h
RXF4EIDL_EID0_MASK                       equ 0001h
RXF4EIDL_EID1_POSN                       equ 0001h
RXF4EIDL_EID1_POSITION                   equ 0001h
RXF4EIDL_EID1_SIZE                       equ 0001h
RXF4EIDL_EID1_LENGTH                     equ 0001h
RXF4EIDL_EID1_MASK                       equ 0002h
RXF4EIDL_EID2_POSN                       equ 0002h
RXF4EIDL_EID2_POSITION                   equ 0002h
RXF4EIDL_EID2_SIZE                       equ 0001h
RXF4EIDL_EID2_LENGTH                     equ 0001h
RXF4EIDL_EID2_MASK                       equ 0004h
RXF4EIDL_EID3_POSN                       equ 0003h
RXF4EIDL_EID3_POSITION                   equ 0003h
RXF4EIDL_EID3_SIZE                       equ 0001h
RXF4EIDL_EID3_LENGTH                     equ 0001h
RXF4EIDL_EID3_MASK                       equ 0008h
RXF4EIDL_EID4_POSN                       equ 0004h
RXF4EIDL_EID4_POSITION                   equ 0004h
RXF4EIDL_EID4_SIZE                       equ 0001h
RXF4EIDL_EID4_LENGTH                     equ 0001h
RXF4EIDL_EID4_MASK                       equ 0010h
RXF4EIDL_EID5_POSN                       equ 0005h
RXF4EIDL_EID5_POSITION                   equ 0005h
RXF4EIDL_EID5_SIZE                       equ 0001h
RXF4EIDL_EID5_LENGTH                     equ 0001h
RXF4EIDL_EID5_MASK                       equ 0020h
RXF4EIDL_EID6_POSN                       equ 0006h
RXF4EIDL_EID6_POSITION                   equ 0006h
RXF4EIDL_EID6_SIZE                       equ 0001h
RXF4EIDL_EID6_LENGTH                     equ 0001h
RXF4EIDL_EID6_MASK                       equ 0040h
RXF4EIDL_EID7_POSN                       equ 0007h
RXF4EIDL_EID7_POSITION                   equ 0007h
RXF4EIDL_EID7_SIZE                       equ 0001h
RXF4EIDL_EID7_LENGTH                     equ 0001h
RXF4EIDL_EID7_MASK                       equ 0080h
RXF4EIDL_RXF4EID0_POSN                   equ 0000h
RXF4EIDL_RXF4EID0_POSITION               equ 0000h
RXF4EIDL_RXF4EID0_SIZE                   equ 0001h
RXF4EIDL_RXF4EID0_LENGTH                 equ 0001h
RXF4EIDL_RXF4EID0_MASK                   equ 0001h
RXF4EIDL_RXF4EID1_POSN                   equ 0001h
RXF4EIDL_RXF4EID1_POSITION               equ 0001h
RXF4EIDL_RXF4EID1_SIZE                   equ 0001h
RXF4EIDL_RXF4EID1_LENGTH                 equ 0001h
RXF4EIDL_RXF4EID1_MASK                   equ 0002h
RXF4EIDL_RXF4EID2_POSN                   equ 0002h
RXF4EIDL_RXF4EID2_POSITION               equ 0002h
RXF4EIDL_RXF4EID2_SIZE                   equ 0001h
RXF4EIDL_RXF4EID2_LENGTH                 equ 0001h
RXF4EIDL_RXF4EID2_MASK                   equ 0004h
RXF4EIDL_RXF4EID3_POSN                   equ 0003h
RXF4EIDL_RXF4EID3_POSITION               equ 0003h
RXF4EIDL_RXF4EID3_SIZE                   equ 0001h
RXF4EIDL_RXF4EID3_LENGTH                 equ 0001h
RXF4EIDL_RXF4EID3_MASK                   equ 0008h
RXF4EIDL_RXF4EID4_POSN                   equ 0004h
RXF4EIDL_RXF4EID4_POSITION               equ 0004h
RXF4EIDL_RXF4EID4_SIZE                   equ 0001h
RXF4EIDL_RXF4EID4_LENGTH                 equ 0001h
RXF4EIDL_RXF4EID4_MASK                   equ 0010h
RXF4EIDL_RXF4EID5_POSN                   equ 0005h
RXF4EIDL_RXF4EID5_POSITION               equ 0005h
RXF4EIDL_RXF4EID5_SIZE                   equ 0001h
RXF4EIDL_RXF4EID5_LENGTH                 equ 0001h
RXF4EIDL_RXF4EID5_MASK                   equ 0020h
RXF4EIDL_RXF4EID6_POSN                   equ 0006h
RXF4EIDL_RXF4EID6_POSITION               equ 0006h
RXF4EIDL_RXF4EID6_SIZE                   equ 0001h
RXF4EIDL_RXF4EID6_LENGTH                 equ 0001h
RXF4EIDL_RXF4EID6_MASK                   equ 0040h
RXF4EIDL_RXF4EID7_POSN                   equ 0007h
RXF4EIDL_RXF4EID7_POSITION               equ 0007h
RXF4EIDL_RXF4EID7_SIZE                   equ 0001h
RXF4EIDL_RXF4EID7_LENGTH                 equ 0001h
RXF4EIDL_RXF4EID7_MASK                   equ 0080h

